
<img src="img/viu_logo.png" width="200">

## 04EPPY - Ciencia de Datos e Inteligencia Artificial
### Pandas

![logo](img/python_logo.png)

*Òscar Garibo*

# Sumario
- Series y DataFrame
- Indexacion, slicing
- Grabar y cargar a archivo
- MovieLens dataset

# Pandas
- Librería (de facto estándar) para estructurar datos tabulares
- Multivariable (string, int, float, bool...)
- Dos clases:
  - Series (1 dimensión)
  - DataFrames (2+ dimensiones)

In [ ]:
!pip install pandas

In [1]:
# librería externa
import pandas as pd
from pandas import Series, DataFrame

# Series
- Datos unidimensionales (similar a NumPy)
- Elementos + índices modificables

In [2]:
countries = pd.Series(['Spain','Andorra','Gibraltar','Portugal','France'])
print(countries)

0        Spain
1      Andorra
2    Gibraltar
3     Portugal
4       France
dtype: object

In [3]:
countries[4]

'France'

In [3]:
# especificando el índice
countries = pd.Series (['Spain','Andorra','Gibraltar','Portugal','France'],
                       index=range(10,60,10))
countries.name = 'Countries in Europe'
countries.index.name = 'INDICE'
print(countries)

INDICE
10        Spain
20      Andorra
30    Gibraltar
40     Portugal
50       France
Name: Countries in Europe, dtype: object

In [5]:
countries[50]

'France'

In [3]:
# los índices pueden ser de más tipos
football_cities = pd.Series(['Barcelona','Madrid','Valencia','Sevilla'], 
                            index=['a','b','c','d'])
football_cities.index.name='Letras'
print(football_cities)

Letras
a    Barcelona
b       Madrid
c     Valencia
d      Sevilla
dtype: object

In [8]:
football_cities['c']

'Valencia'

In [4]:
# Atributos
football_cities.name = 'Ciudades con dos equipos en primera' # nombrar la Serie
football_cities.index.name = 'Id' # Describir los índices
print(football_cities)

Id
a    Barcelona
b       Madrid
c     Valencia
d      Sevilla
Name: Ciudades con dos equipos en primera, dtype: object

In [5]:
# acceso similar a NumPy o listas, según posición
print(football_cities[2])

# acceso a través del índice semántico
print(football_cities['c'])

print(football_cities['c'] == football_cities[2])

Valencia
Valencia
True

# Tratamiento similar a ndarray

In [11]:
# múltiple recolección de elementos
print(football_cities[ ['a','c'] ])
print(football_cities[ [0, 2] ])

Id
a    Barcelona
c     Valencia
Name: Ciudades con dos equipos en primera, dtype: object
Id
a    Barcelona
c     Valencia
Name: Ciudades con dos equipos en primera, dtype: object

In [12]:
# slicing
print(football_cities[:'c']) # incluye ambos extremos con el indice semantico
print(football_cities[:2])

Id
a    Barcelona
b       Madrid
c     Valencia
Name: Ciudades con dos equipos en primera, dtype: object
Id
a    Barcelona
b       Madrid
Name: Ciudades con dos equipos en primera, dtype: object

In [6]:
#cast a list
lista = list(football_cities[:'c'])
print(lista)

['Barcelona', 'Madrid', 'Valencia']

In [14]:
type(football_cities[:'c'])

pandas.core.series.Series

In [6]:
# uso de masks para seleccionar
fibonacci = pd.Series([0, 1, 1, 2, 3, 5, 8, 13, 21])
mask = fibonacci >= 5
print(mask)
print(fibonacci[mask])

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool
5     5
6     8
7    13
8    21
dtype: int64

In [7]:
sum(fibonacci)

54

In [8]:
# aplicar funciones de numpy a la serie
import numpy as np

np.sum(fibonacci)

54

In [11]:
#filtrado con np.where
distances = pd.Series([12.1,np.nan,12.8,76.9,6.1,7.2])
valid_distances = np.where(pd.notnull(distances),distances,0)
print(valid_distances)

[12.1  0.  12.8 76.9  6.1  7.2]

### Iteración

In [27]:
fibonacci = pd.Series([0, 1, 1, 2, 3, 5, 8, 13, 21],index=range(5,50,5))

In [28]:
fibonacci

5      0
10     1
15     1
20     2
25     3
30     5
35     8
40    13
45    21
dtype: int64

In [29]:
# iterar sobre elementos
for value in fibonacci:
    print('Value: ' + str(value))

# iterar sobre indices
for index in fibonacci.index:
    print('Index: ' + str(index))

Value: 0
Value: 1
Value: 1
Value: 2
Value: 3
Value: 5
Value: 8
Value: 13
Value: 21
Index: 5
Index: 10
Index: 15
Index: 20
Index: 25
Index: 30
Index: 35
Index: 40
Index: 45

In [20]:
# iterar sobre elementos e índices al mismo tiempo
for index, value in fibonacci.items():  #.iteritems()
    print('Index: ' + str(index) + '  Value: ' + str(value))

Index: 10  Value: 0
Index: 20  Value: 1
Index: 30  Value: 1
Index: 40  Value: 2
Index: 50  Value: 3
Index: 60  Value: 5
Index: 70  Value: 8
Index: 80  Value: 13
Index: 90  Value: 21

In [21]:
for index, value in zip(fibonacci.index, fibonacci):
    print('Index: ' + str(index) + '  Value: ' + str(value))

Index: 10  Value: 0
Index: 20  Value: 1
Index: 30  Value: 1
Index: 40  Value: 2
Index: 50  Value: 3
Index: 60  Value: 5
Index: 70  Value: 8
Index: 80  Value: 13
Index: 90  Value: 21

## Series como diccionarios
- Interpretar el índice como clave
- Acepta operaciones para diccionarios

In [27]:
# crear una serie a partir de un diccionario
serie = pd.Series( { 'Carlos' : 100, 'Marcos': 98} )
print(serie.index)
print(serie.values)
print(serie)

Index(['Carlos', 'Marcos'], dtype='object')
[100  98]
Carlos    100
Marcos     98
dtype: int64

In [28]:
# añade y elimina elementos a través de índices
serie['Pedro'] = 12
del serie['Marcos']
print(serie)

Carlos    100
Pedro      12
dtype: int64

In [29]:
_dict = { 'Carlos' : 100, 'Marcos': 98}

In [30]:
'Oscar' in _dict

False

In [ ]:
_dict['Oscar'] = 2

In [31]:
# query una serie
if 'Carlos' in serie:
    serie['Carlos'] = 2
    
print(serie)

Carlos     2
Pedro     12
dtype: int64

## Operaciones entre series

In [36]:
# suma de dos series
# suma de valores con el mismo índice (NaN si no aparece en ambas)
serie1 = pd.Series([10,20,30,40,50,60,70],index=range(7))
serie2 = pd.Series([1,2,3],index=range(3) )
print(serie1 + serie2)

0    11.0
1    22.0
2    33.0
3     NaN
4     NaN
5     NaN
6     NaN
dtype: float64

In [33]:
serie3 = pd.Series( {0: 10, 1:20, 2:30, 3:40})
serie3

0    10
1    20
2    30
3    40
dtype: int64

In [34]:
# resta de series (similar a la suma)
print(serie1 - serie3)

0    0.0
1    0.0
2    0.0
3    0.0
4    NaN
5    NaN
6    NaN
dtype: float64

In [37]:
# operaciones de pre-filtrado
result = serie1 + serie3
result[pd.isnull(result)] = 0 # mask con isnull()
print(result)

0    20.0
1    40.0
2    60.0
3    80.0
4     0.0
5     0.0
6     0.0
dtype: float64

In [38]:
result = serie1 + serie2
mask = pd.isnull(result)
result[mask] = 0
print(result)

0    11.0
1    22.0
2    33.0
3     0.0
4     0.0
5     0.0
6     0.0
dtype: float64

In [41]:
lista = [1,2,3,4,5,6,7]

serie1 + lista

0    11
1    22
2    33
3    44
4    55
5    66
6    77
dtype: int64

###  Diferencias entre Pandas Series y diccionario
* Diccionario, es una estructura que relaciona las claves y los valores de forma arbitraria.
* Series, estructura de forma estricta listas de valores con listas de índice asignado en la posición.
* Series, es más eficiente para ciertas operaciones que los dicionarios.
* En las Series los valores de entrada pueden ser listas o Numpy arrays.
* En Series los índices semánticos pueden ser integers o caracteres, en los valores igual.
* Series se podría entender entre una lista y un diccionario Python, pero es de una dimensión.

# DataFrame
- Datos tabulares (filas x columnas)
- Columnas: Series con índices compartidos

In [46]:
# crear un DataFrame a partir de un diccionario de elementos de la misma longitud
diccionario = { "Nombre" : ["Marisa","Laura","Manuel"], 
                "Edad" : [34,29,12] }
# las claves identifican columnas
frame = pd.DataFrame(diccionario)
display(frame)

   Nombre  Edad
0  Marisa    34
1   Laura    29
2  Manuel    12

In [47]:
frame.head(1)
frame.tail(1)

   Nombre  Edad
2  Manuel    12

In [24]:
# crear un DataFrame a partir de un diccionario de elementos de la misma longitud
diccionario = { "Nombre" : ["Marisa","Laura","Manuel"], 
                "Edad" : [34,29,12] }
# las claves identifican columnas
frame = pd.DataFrame(diccionario, index = ['a', 'b', 'c'])
display(frame)

   Nombre  Edad
a  Marisa    34
b   Laura    29
c  Manuel    12

In [25]:
# además de 'index', el parámetro 'columns' especifica el número y orden de las columnas
frame = pd.DataFrame(diccionario, columns = ['Nacionalidad', 'Nombre', 'Edad', 'Profesion'])
display(frame)

  Nacionalidad  Nombre  Edad Profesion
0          NaN  Marisa    34       NaN
1          NaN   Laura    29       NaN
2          NaN  Manuel    12       NaN

In [26]:
# acceso a columnas
nombres = frame['Nombre']
display(nombres)
type(nombres)

0    Marisa
1     Laura
2    Manuel
Name: Nombre, dtype: object

pandas.core.series.Series

In [27]:
nombres = list(frame['Nombre'])
type(nombres)

list

In [28]:
frame.Nombre

0    Marisa
1     Laura
2    Manuel
Name: Nombre, dtype: object

In [52]:
#siempre que el nombre de la columna lo permita (espacios, ...)
nombres = frame.Nombre
display(nombres)
type(nombres)

0    Marisa
1     Laura
2    Manuel
Name: Nombre, dtype: object

pandas.core.series.Series

In [53]:
# acceso al primer nombre del DataFrame frame??
print(frame['Nombre'][0])
print(frame.Nombre[0])
print(nombres[0])

Marisa
Marisa
Marisa

In [58]:
frame["Raza"] = "Qué más da?"

In [59]:
frame["Raza"]

0    Qué más da?
1    Qué más da?
2    Qué más da?
Name: Raza, dtype: object

### Formas de crear un DataFrame
* Con una Serie de pandas
* Lista de diccionarios
* Dicionario de Series de Pandas
* Con un array de Numpy de dos dimensiones
* Con array estructurado de Numpy

## Modificar DataFrames

In [30]:
# añadir columnas
frame = pd.DataFrame(diccionario,columns=['Nacionalidad', 'Nombre', 'Edad', 'Profesion', 'Dirección'])
frame['Dirección'] = 'Desconocida'
frame['Dirección'][1]='La Laguna'
display(frame)

C:\Users\Usuario\AppData\Local\Temp\ipykernel_20088\353464632.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  frame['Dirección'][1]='La Laguna'

  Nacionalidad  Nombre  Edad Profesion    Dirección
0          NaN  Marisa    34       NaN  Desconocida
1          NaN   Laura    29       NaN    La Laguna
2          NaN  Manuel    12       NaN  Desconocida

In [31]:
lista_direcciones = ['Rue 13 del Percebe, 13, 1, 3', 'Calla Maravilla, 2,3', 'Avenida de los Rombos, 12, 1']

In [32]:
frame['Dirección'] = lista_direcciones

frame

  Nacionalidad  Nombre  Edad Profesion                     Dirección
0          NaN  Marisa    34       NaN  Rue 13 del Percebe, 13, 1, 3
1          NaN   Laura    29       NaN          Calla Maravilla, 2,3
2          NaN  Manuel    12       NaN  Avenida de los Rombos, 12, 1

In [63]:
len(frame)

3

In [33]:
# añadir fila (requiere todos los valores)
user_2 = ['Alemana','Klaus',39, np.nan, 'Desconocida']
frame.loc[len(frame)] = user_2
display(frame)

  Nacionalidad  Nombre  Edad Profesion                     Dirección
0          NaN  Marisa    34       NaN  Rue 13 del Percebe, 13, 1, 3
1          NaN   Laura    29       NaN          Calla Maravilla, 2,3
2          NaN  Manuel    12       NaN  Avenida de los Rombos, 12, 1
3      Alemana   Klaus    39       NaN                   Desconocida

In [65]:
frame.loc?

Type:        property
String form: <property object at 0x000002322D439120>
Docstring:
Access a group of rows and columns by label(s) or a boolean array.

``.loc[]`` is primarily label based, but may also be used with a
boolean array.

Allowed inputs are:

- A single label, e.g. ``5`` or ``'a'``, (note that ``5`` is
  interpreted as a *label* of the index, and **never** as an
  integer position along the index).
- A list or array of labels, e.g. ``['a', 'b', 'c']``.
- A slice object with labels, e.g. ``'a':'f'``.

  .. warning:: Note that contrary to usual python slices, **both** the
      start and the stop are included

- A boolean array of the same length as the axis being sliced,
  e.g. ``[True, False, True]``.
- An alignable boolean Series. The index of the key will be aligned before
  masking.
- An alignable Index. The Index of the returned selection will be the input.
- A ``callable`` function with one argument (the calling Series or
  DataFrame) and that returns valid output for indexing (one of the above)

See more at :ref:`Selection by Label <indexing.label>`.

Raises
------
KeyError
    If any items are not found.
IndexingError
    If an indexed key is passed and its index is unalignable to the frame index.

See Also
--------
DataFrame.at : Access a single value for a row/column label pair.
DataFrame.iloc : Access group of rows and columns by integer position(s).
DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
    Series/DataFrame.
Series.loc : Access group of values using labels.

Examples
--------
**Getting values**

>>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
...      index=['cobra', 'viper', 'sidewinder'],
...      columns=['max_speed', 'shield'])
>>> df
            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

Single label. Note this returns the row as a Series.

>>> df.loc['viper']
max_speed    4
shield       5
Name: viper, dtype: int64

List of labels. Note using ``[[]]`` returns a DataFrame.

>>> df.loc[['viper', 'sidewinder']]
            max_speed  shield
viper               4       5
sidewinder          7       8

Single label for row and column

>>> df.loc['cobra', 'shield']
2

Slice with labels for row and single label for column. As mentioned
above, note that both the start and stop of the slice are included.

>>> df.loc['cobra':'viper', 'max_speed']
cobra    1
viper    4
Name: max_speed, dtype: int64

Boolean list with the same length as the row axis

>>> df.loc[[False, False, True]]
            max_speed  shield
sidewinder          7       8

Alignable boolean Series:

>>> df.loc[pd.Series([False, True, False],
...        index=['viper', 'sidewinder', 'cobra'])]
            max_speed  shield
sidewinder          7       8

Index (same behavior as ``df.reindex``)

>>> df.loc[pd.Index(["cobra", "viper"], name="foo")]
       max_speed  shield
foo
cobra          1       2
viper          4       5

Conditional that returns a boolean Series

>>> df.loc[df['shield'] > 6]
            max_speed  shield
sidewinder          7       8

Conditional that returns a boolean Series with column labels specified

>>> df.loc[df['shield'] > 6, ['max_speed']]
            max_speed
sidewinder          7

Callable that returns a boolean Series

>>> df.loc[lambda df: df['shield'] == 8]
            max_speed  shield
sidewinder          7       8

**Setting values**

Set value for all items matching the list of labels

>>> df.loc[['viper', 'sidewinder'], ['shield']] = 50
>>> df
            max_speed  shield
cobra               1       2
viper               4      50
sidewinder          7      50

Set value for an entire row

>>> df.loc['cobra'] = 10
>>> df
            max_speed  shield
cobra              10      10
viper               4      50
sidewinder          7      50

Set value for an entire column

>>> df.loc[:, 'max_speed'] = 30
>>> df
            max_speed  shield
cobra              30      10
viper              30      50
sidewinder         30      50

Set value for rows matching callable condition

>>> df.loc[df['shield'] > 35] = 0
>>> df
            max_speed  shield
cobra              30      10
viper               0       0
sidewinder          0       0

**Getting values on a DataFrame with an index that has integer labels**

Another example using integers for the index

>>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
...      index=[7, 8, 9], columns=['max_speed', 'shield'])
>>> df
   max_speed  shield
7          1       2
8          4       5
9          7       8

Slice with integer labels for rows. As mentioned above, note that both
the start and stop of the slice are included.

>>> df.loc[7:9]
   max_speed  shield
7          1       2
8          4       5
9          7       8

**Getting values with a MultiIndex**

A number of examples using a DataFrame with a MultiIndex

>>> tuples = [
...    ('cobra', 'mark i'), ('cobra', 'mark ii'),
...    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
...    ('viper', 'mark ii'), ('viper', 'mark iii')
... ]
>>> index = pd.MultiIndex.from_tuples(tuples)
>>> values = [[12, 2], [0, 4], [10, 20],
...         [1, 4], [7, 1], [16, 36]]
>>> df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
>>> df
                     max_speed  shield
cobra      mark i           12       2
           mark ii           0       4
sidewinder mark i           10      20
           mark ii           1       4
viper      mark ii           7       1
           mark iii         16      36

Single label. Note this returns a DataFrame with a single index.

>>> df.loc['cobra']
         max_speed  shield
mark i          12       2
mark ii          0       4

Single index tuple. Note this returns a Series.

>>> df.loc[('cobra', 'mark ii')]
max_speed    0
shield       4
Name: (cobra, mark ii), dtype: int64

Single label for row and column. Similar to passing in a tuple, this
returns a Series.

>>> df.loc['cobra', 'mark i']
max_speed    12
shield        2
Name: (cobra, mark i), dtype: int64

Single tuple. Note using ``[[]]`` returns a DataFrame.

>>> df.loc[[('cobra', 'mark ii')]]
               max_speed  shield
cobra mark ii          0       4

Single tuple for the index with a single label for the column

>>> df.loc[('cobra', 'mark i'), 'shield']
2

Slice from index tuple to single label

>>> df.loc[('cobra', 'mark i'):'viper']
                     max_speed  shield
cobra      mark i           12       2
           mark ii           0       4
sidewinder mark i           10      20
           mark ii           1       4
viper      mark ii           7       1
           mark iii         16      36

Slice from index tuple to index tuple

>>> df.loc[('cobra', 'mark i'):('viper', 'mark ii')]
                    max_speed  shield
cobra      mark i          12       2
           mark ii          0       4
sidewinder mark i          10      20
           mark ii          1       4
viper      mark ii          7       1

Please see the :ref:`user guide<advanced.advanced_hierarchical>`
for more details and explanations of advanced indexing.

In [34]:
frame.drop(2)

  Nacionalidad  Nombre  Edad Profesion                     Dirección
0          NaN  Marisa    34       NaN  Rue 13 del Percebe, 13, 1, 3
1          NaN   Laura    29       NaN          Calla Maravilla, 2,3
3      Alemana   Klaus    39       NaN                   Desconocida

In [35]:
frame

  Nacionalidad  Nombre  Edad Profesion                     Dirección
0          NaN  Marisa    34       NaN  Rue 13 del Percebe, 13, 1, 3
1          NaN   Laura    29       NaN          Calla Maravilla, 2,3
2          NaN  Manuel    12       NaN  Avenida de los Rombos, 12, 1
3      Alemana   Klaus    39       NaN                   Desconocida

In [36]:
# eliminar fila (similar a Series)
frame = pd.DataFrame(diccionario,columns=['Nacionalidad', 'Nombre', 'Edad', 'Profesion'])

#frame = frame.drop(2) # por qué necesitamos reasignar el frame?
display(frame)

frame.drop(1, inplace = True)
display(frame)

  Nacionalidad  Nombre  Edad Profesion
0          NaN  Marisa    34       NaN
1          NaN   Laura    29       NaN
2          NaN  Manuel    12       NaN

  Nacionalidad  Nombre  Edad Profesion
0          NaN  Marisa    34       NaN
2          NaN  Manuel    12       NaN

In [30]:
#eliminar columna
del frame['Profesion']
display(frame)

NameError: name 'frame' is not defined

In [38]:
# acceder a la traspuesta (como una matriz)
display(frame.T)

                   0       2
Nacionalidad     NaN     NaN
Nombre        Marisa  Manuel
Edad              34      12

## Iteración

In [39]:
# iteración sobre el DataFrame?
frame = pd.DataFrame(diccionario, columns=['Nacionalidad', 'Nombre', 'Edad', 'Profesion'])

for a in frame:
    print(a) # qué es 'a'?
    print(type(a))

Nacionalidad
<class 'str'>
Nombre
<class 'str'>
Edad
<class 'str'>
Profesion
<class 'str'>

In [40]:
frame

  Nacionalidad  Nombre  Edad Profesion
0          NaN  Marisa    34       NaN
1          NaN   Laura    29       NaN
2          NaN  Manuel    12       NaN

In [41]:
# iteracion sobre filas
for value in frame.values:
    print(value)
    #print(type(value))

[nan 'Marisa' 34 nan]
[nan 'Laura' 29 nan]
[nan 'Manuel' 12 nan]

In [42]:
# iterar sobre filas y luego sobre cada valor?
for values in frame.values:
    print('\n')
    for value in values: 
        print(value)

nan
Marisa
34
nan


nan
Laura
29
nan


nan
Manuel
12
nan

In [31]:
d_and_d_characters = {'Name' : ['bundenth','theorin','barlok'], 'Strength' : [10,12,19], 'Wisdom' : [20,13,6]}
character_data = pd.DataFrame(d_and_d_characters)

In [32]:
print('Original data')
display(character_data)

Original data

       Name  Strength  Wisdom
0  bundenth        10      20
1   theorin        12      13
2    barlok        19       6

In [33]:
vitality_data = pd.Series([11,10,14])

In [34]:
character_data['vitality'] = vitality_data

In [35]:
character_data

       Name  Strength  Wisdom  vitality
0  bundenth        10      20        11
1   theorin        12      13        10
2    barlok        19       6        14

In [36]:
character_data['alive'] = True

In [45]:
character_data['beuty'] = [0,1,2]

In [46]:
potencia = character_data['Strength']

In [ ]:
type(potencia)

In [47]:
import numpy as np

In [48]:
powerfull = np.where(potencia > 15, 'Fuerte', 'Debilucho')

In [49]:
powerfull

array(['Debilucho', 'Debilucho', 'Fuerte'], dtype='<U9')

In [50]:
character_data['Class'] = powerfull

In [51]:
character_data

       Name  Strength  Wisdom  vitality  alive  beuty      Class
0  bundenth        10      20        11   True      0  Debilucho
1   theorin        12      13        10   True      1  Debilucho
2    barlok        19       6        14   True      2     Fuerte

In [52]:
character_data[character_data['Wisdom'] > 8]
# and-> &; or->|

       Name  Strength  Wisdom  vitality  alive  beuty      Class
0  bundenth        10      20        11   True      0  Debilucho
1   theorin        12      13        10   True      1  Debilucho

## Indexación y slicing con DataFrames

In [53]:
d1 = {'ciudad':'Valencia', 'temperatura':10, 'o2':1}
d2 = {'ciudad':'Barcelona', 'temperatura':8}
d3 = {'ciudad':'Valencia', 'temperatura':9}
d4 = {'ciudad':'Madrid', 'temperatura':10, 'humedad':80}
d5 = {'ciudad':'Sevilla', 'temperatura':15, 'humedad':50, 'co2':6}
d6 = {'ciudad':'Valencia', 'temperatura':10, 'humedad':90, 'co2':10}
ls_data = [d1, d2, d3, d4, d5, d6]  # lista de diccionarios
df_data = pd.DataFrame(ls_data, index = list('abcdef')) 
display(df_data)

      ciudad  temperatura   o2  humedad   co2
a   Valencia           10  1.0      NaN   NaN
b  Barcelona            8  NaN      NaN   NaN
c   Valencia            9  NaN      NaN   NaN
d     Madrid           10  NaN     80.0   NaN
e    Sevilla           15  NaN     50.0   6.0
f   Valencia           10  NaN     90.0  10.0

In [56]:
df_data.loc['a']

ciudad         Valencia
temperatura          10
o2                  1.0
humedad             NaN
co2                 NaN
Name: a, dtype: object

In [57]:
import pandas as pd

In [58]:
df_data.iloc[3]

ciudad         Madrid
temperatura        10
o2                NaN
humedad          80.0
co2               NaN
Name: d, dtype: object

In [59]:
# Acceso a un valor concreto por indice posicional [row, col]
#print(df_data.iloc[0])
x = df_data.iloc[0]
# # Acceso a todos los valores hasta un índice por enteros
#display(df_data.iloc[:3,:4])

# # Acceso a datos de manera explícita, indice semantico (se incluyen)
display(df_data.loc['d', 'temperatura'])
display(df_data.loc[:'c', :'o2'])
display(df_data.loc[:'c', 'temperatura':'o2'])

display(df_data.loc[:, ['ciudad','temperatura']])

10

      ciudad  temperatura   o2
a   Valencia           10  1.0
b  Barcelona            8  NaN
c   Valencia            9  NaN

   temperatura   o2
a           10  1.0
b            8  NaN
c            9  NaN

      ciudad  temperatura
a   Valencia           10
b  Barcelona            8
c   Valencia            9
d     Madrid           10
e    Sevilla           15
f   Valencia           10

In [60]:
for i in range(len(df_data)):
    x = df_data.iloc[i]
    if x['ciudad'] == 'Valencia':
        print('Bingo!')

Bingo!
Bingo!
Bingo!

In [63]:
x

ciudad         Valencia
temperatura          10
o2                  NaN
humedad            90.0
co2                10.0
Name: f, dtype: object

In [61]:
x['ciudad']

'Valencia'

In [62]:
for i in range(len(df_data)):
    x = df_data.iloc[i]
    print(x['ciudad'])

Valencia
Barcelona
Valencia
Madrid
Sevilla
Valencia

In [63]:
# indexación con nombre de columna (por columnas)
print(df_data['ciudad']) # --> Series

display(df_data[['ciudad', 'o2']])

a     Valencia
b    Barcelona
c     Valencia
d       Madrid
e      Sevilla
f     Valencia
Name: ciudad, dtype: object

      ciudad   o2
a   Valencia  1.0
b  Barcelona  NaN
c   Valencia  NaN
d     Madrid  NaN
e    Sevilla  NaN
f   Valencia  NaN

In [67]:
# indexación con índice posicional (no permitido!). Esto busca columna.
df_data[0]

KeyError: 0

In [68]:
df_data['ciudad']['a':'c']

a     Valencia
b    Barcelona
c     Valencia
Name: ciudad, dtype: object

In [69]:
# indexar por posición con 'iloc'
print(df_data.iloc[0]) # --> Series de la primera fila (qué marca los índices)

ciudad         Valencia
temperatura          10
o2                  1.0
humedad             NaN
co2                 NaN
Name: a, dtype: object

In [70]:
# indexar semántico con 'loc'
df_data.loc['a'] # --> Series de la fila con índice 'a'

ciudad         Valencia
temperatura          10
o2                  1.0
humedad             NaN
co2                 NaN
Name: a, dtype: object

In [71]:
# indexar semántico con 'loc'
df_data.loc['a':'c'] # --> DataFrame de la fila con índice 'a'

      ciudad  temperatura   o2  humedad  co2
a   Valencia           10  1.0      NaN  NaN
b  Barcelona            8  NaN      NaN  NaN
c   Valencia            9  NaN      NaN  NaN

In [8]:
# si se modifica una porcion del dataframe se modifica el dataframe original (referencia)
serie = df_data.loc['a']
serie[2] = 3000

display(df_data)

print(serie)

# copiar data frame
df_2 = df_data#.copy()

C:\Users\Usuario\AppData\Local\Temp\ipykernel_9084\1030160360.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  serie[2] = 3000

      ciudad  temperatura   o2  humedad   co2
a   Valencia           10  1.0      NaN   NaN
b  Barcelona            8  NaN      NaN   NaN
c   Valencia            9  NaN      NaN   NaN
d     Madrid           10  NaN     80.0   NaN
e    Sevilla           15  NaN     50.0   6.0
f   Valencia           10  NaN     90.0  10.0

ciudad         Valencia
temperatura          10
o2                 3000
humedad             NaN
co2                 NaN
Name: a, dtype: object

In [9]:
df_data.loc['a']['o2']

1.0

In [10]:
df_data.loc['a']['o2'] = 3000

C:\Users\Usuario\AppData\Local\Temp\ipykernel_9084\2249495184.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_data.loc['a']['o2'] = 3000

In [11]:
df_data.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [12]:
df_data.at['a','o2'] = 3000

In [13]:
for _fila in df_data.index:
    x = df_data.loc[_fila]
    if x['ciudad'] == 'Valencia':
        df_data.at[_fila, 'humedad'] = 1000000

In [14]:
df_data

      ciudad  temperatura      o2    humedad   co2
a   Valencia           10  3000.0  1000000.0   NaN
b  Barcelona            8     NaN        NaN   NaN
c   Valencia            9     NaN  1000000.0   NaN
d     Madrid           10     NaN       80.0   NaN
e    Sevilla           15     NaN       50.0   6.0
f   Valencia           10     NaN  1000000.0  10.0

In [15]:
df_2 = df_data.copy()

serie = df_2.loc['a']

serie[2] = 3000

C:\Users\Usuario\AppData\Local\Temp\ipykernel_9084\313043881.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  serie[2] = 3000

In [16]:
df_data

      ciudad  temperatura      o2    humedad   co2
a   Valencia           10  3000.0  1000000.0   NaN
b  Barcelona            8     NaN        NaN   NaN
c   Valencia            9     NaN  1000000.0   NaN
d     Madrid           10     NaN       80.0   NaN
e    Sevilla           15     NaN       50.0   6.0
f   Valencia           10     NaN  1000000.0  10.0

In [70]:
# ambos aceptan 'axis' como argumento
#df_data.iloc(axis=1)[0] # --> todos los valores asignados a la primera columna 'ciudad'
df_data.loc(axis=1)['ciudad'] # --> preferible el equivalente frame['ciudad']

a     Valencia
b    Barcelona
c     Valencia
d       Madrid
e      Sevilla
f     Valencia
Name: ciudad, dtype: object

In [71]:
df_data['ciudad']

a     Valencia
b    Barcelona
c     Valencia
d       Madrid
e      Sevilla
f     Valencia
Name: ciudad, dtype: object

In [19]:
# qué problema puede tener este fragmento?
frame = pd.DataFrame({"Name" : ['Carlos','Pedro'], "Age" : [34,22]}, index=[1,0])
display(frame)

     Name  Age
1  Carlos   34
0   Pedro   22

In [72]:
# por defecto, pandas interpreta índice posicional --> error en frames
# cuando hay posible ambigüedad, utilizar loc y iloc
print('Primera fila\n')
print(frame.iloc[0])
print('\nElemento con index 0\n')
print(frame.loc[1])

Primera fila

NameError: name 'frame' is not defined

## Objeto Index de Pandas

In [21]:
# Contrucción de índices
ind = pd.Index([2, 3, 5, 7, 11])
# recuperar datos
print(ind[3])
#print(ind[::2])

7

In [22]:
# Son inmutables! No se modifican los datos. 
ind[3] = 8

TypeError: Index does not support mutable operations

In [23]:
pd.Index([900 + 3j, 700 + 25j, 620 + 10j, 388 + 44j, 900])

Index([(900+3j), (700+25j), (620+10j), (388+44j), (900+0j)], dtype='complex128')

## Slicing

In [24]:
# slice por filas
d_and_d_characters = {'Name' : ['bundenth','theorin, hijo de alguien','barlok'], 'Strength' : [10,12,19], 'Wisdom' : [20,13,6]}
character_data = pd.DataFrame(d_and_d_characters, index=['a','b','c'])
display(character_data)
display(character_data[:-1])
display(character_data[1:2])

                       Name  Strength  Wisdom
a                  bundenth        10      20
b  theorin, hijo de alguien        12      13
c                    barlok        19       6

                       Name  Strength  Wisdom
a                  bundenth        10      20
b  theorin, hijo de alguien        12      13

                       Name  Strength  Wisdom
b  theorin, hijo de alguien        12      13

In [25]:
# slicing para columnas
display(character_data[['Name','Strength']])

                       Name  Strength
a                  bundenth        10
b  theorin, hijo de alguien        12
c                    barlok        19

In [26]:
#slicing con 'loc' e 'iloc'
display(character_data.iloc[1:])
display(character_data.loc[:'b'])

                       Name  Strength  Wisdom
b  theorin, hijo de alguien        12      13
c                    barlok        19       6

                       Name  Strength  Wisdom
a                  bundenth        10      20
b  theorin, hijo de alguien        12      13

¿Cómo filtrar filas y columnas? Por ejemplo, para todos los personajes, obtener 'Name' y 'Strength'

In [74]:
# usando 'loc' para hacer slicing
display(character_data.loc[:,'Name':'Strength'])

       Name  Strength
0  bundenth        10
1   theorin        12
2    barlok        19

In [28]:
# usando 'loc' para buscar específicamente filas y columnas
display(character_data.loc[ ['a','c'], ['Name','Wisdom'] ])

       Name  Wisdom
a  bundenth      20
c    barlok       6

In [29]:
# lo mismo con 'iloc'?
display(character_data.iloc[[0,2],[0,2]])
display(character_data.iloc[[0,-1],[0,-1]])

       Name  Wisdom
a  bundenth      20
c    barlok       6

       Name  Wisdom
a  bundenth      20
c    barlok       6

In [30]:
# lista de los personajes con el atributo Strength > 11
display(character_data.loc[character_data['Strength'] > 11, ['Name', 'Strength']])

                       Name  Strength
b  theorin, hijo de alguien        12
c                    barlok        19

In [33]:
# listar los personajes con Strength > 15 o Wisdom > 15
display(character_data.loc[(character_data['Strength'] > 15) | (character_data['Wisdom'] > 15)])

       Name  Strength  Wisdom
a  bundenth        10      20
c    barlok        19       6

# Cargar y guardar datos en pandas

In [34]:
character_data

                       Name  Strength  Wisdom
a                  bundenth        10      20
b  theorin, hijo de alguien        12      13
c                    barlok        19       6

In [ ]:
# Guardar a csv
import os
ruta = os.path.join("res" ,"o_d_d_characters.csv")
character_data.to_csv(ruta, sep=';') # sep por defecto: ','

In [ ]:
'res' + '/' + 'o_d_d_charcaters.csv'

In [ ]:
ruta

In [ ]:
loaded = pd.read_csv(ruta, sep=';')
display(loaded)

In [ ]:
loaded = pd.read_csv(ruta, sep=';', index_col = 0)
display(loaded)

In [ ]:
pd.read_csv?

#### otros argumentos to_csv()
- na_rep='string' --> representar valores NaN en el archivo csv

#### otros argumentos read_csv()
- na_values='string'

Pandas también ofrece funciones para leer/guardar a otros formatos estándares: JSON, HDF5 o Excel en su [API](https://pandas.pydata.org/pandas-docs/stable/reference/io.html)

# Ejemplo práctico en pandas
- [MovieLens dataset](https://grouplens.org/datasets/movielens/)
 - Reviews de películas
 - 1 millón de entradas
 - Datos demográficos de usuarios

In [2]:
import numpy as np
import pandas as pd
import zipfile # para descomprimir archivos zip
import urllib.request # para descargar de URL
import os

# descargar MovieLens dataset
url = 'http://files.grouplens.org/datasets/movielens/ml-1m.zip'  
ruta = os.path.join("res", "ml-1m.zip")
urllib.request.urlretrieve(url, ruta)

('res\\ml-1m.zip', <http.client.HTTPMessage at 0x21c6acbecb0>)

In [3]:
# descomprimiendo archivo zip
ruta_ext = os.path.join("res")
with zipfile.ZipFile(ruta, 'r') as zip: 
    print('Extracting all files...') 
    zip.extractall(ruta_ext) # destinación
    print('Done!') 
    
# take a look at readme y revisar formatos

Extracting all files...
Done!

In [4]:
ruta_users = os.path.join("res", "ml-1m", "users.dat")

users_dataset = pd.read_csv(ruta_users, sep='::', index_col=0, engine='python')
display(users_dataset)

      F  1.1  10  48067
1
2     M   56  16  70072
3     M   25  15  55117
4     M   45   7  02460
5     M   25  20  55455
6     F   50   9  55117
...  ..  ...  ..    ...
6036  F   25  15  32603
6037  F   45   1  76006
6038  F   56   1  14706
6039  F   45   0  01060
6040  M   25   6  11106

[6039 rows x 4 columns]

In [7]:
# Varios problemas
# sin cabecera! primer valor se ha perdido
# las columnas no tienen nombres
pd.read_csv?

In [8]:
# especificar nombres, cargar sin cabecera
users_dataset = pd.read_csv(ruta_users, index_col=0, sep='::',
    header=None, names=['UserID','Gender','Age','Occupation','Zip-code'], engine='python')
display(users_dataset)

       Gender  Age  Occupation Zip-code
UserID
1           F    1          10    48067
2           M   56          16    70072
3           M   25          15    55117
4           M   45           7    02460
5           M   25          20    55455
...       ...  ...         ...      ...
6036        F   25          15    32603
6037        F   45           1    76006
6038        F   56           1    14706
6039        F   45           0    01060
6040        M   25           6    11106

[6040 rows x 4 columns]

In [10]:
# samplear la tabla, datos aleatorios
display(users_dataset.sample(15))

       Gender  Age  Occupation Zip-code
UserID
2639        F   25           6    80236
2723        F   25           9    28147
4756        M   56          16    55901
1144        M   25           7    94025
5879        M   35           7    02135
1992        M   18           4    85259
5650        F   35          12    91104
499         F   25           1    55108
2980        M   45           7    91766
1218        M   56          15    13207
3761        M   25          17    27613
368         M   25           0    90293
4788        M   35           7    85331
821         M   18           2    14456
25          M   18           4    01609

In [9]:
# samplear la cabeza
display(users_dataset.head())

       Gender  Age  Occupation Zip-code
UserID
1           F    1          10    48067
2           M   56          16    70072
3           M   25          15    55117
4           M   45           7    02460
5           M   25          20    55455

In [11]:
# samplear la cola
display(users_dataset.tail(4))

       Gender  Age  Occupation Zip-code
UserID
6037        F   45           1    76006
6038        F   56           1    14706
6039        F   45           0    01060
6040        M   25           6    11106

In [12]:
# tipos de datos sobre las columnas
users_dataset.dtypes

Gender        object
Age            int64
Occupation     int64
Zip-code      object
dtype: object

In [13]:
display(users_dataset[users_dataset['Zip-code'].str.len() > 5])

       Gender  Age  Occupation    Zip-code
UserID
161         M   45          16  98107-2117
233         F   45          20  37919-4204
293         M   56           1  55337-4056
458         M   50          16  55405-2546
506         M   25          16  55103-1006
...       ...  ...         ...         ...
5682        M   18           0  23455-4959
5904        F   45          12      954025
5925        F   25           0  90035-4444
5967        M   50          16  73069-5429
5985        F   18           4  78705-5221

[81 rows x 4 columns]

In [14]:
# información general sobre atributos numéricos
display(users_dataset.describe())

               Age   Occupation
count  6040.000000  6040.000000
mean     30.639238     8.146854
std      12.895962     6.329511
min       1.000000     0.000000
25%      25.000000     3.000000
50%      25.000000     7.000000
75%      35.000000    14.000000
max      56.000000    20.000000

In [15]:
users_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6040 entries, 1 to 6040
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Gender      6040 non-null   object
 1   Age         6040 non-null   int64
 2   Occupation  6040 non-null   int64
 3   Zip-code    6040 non-null   object
dtypes: int64(2), object(2)
memory usage: 235.9+ KB

In [16]:
# incluir otros atributos (no todo tiene sentido)
display(users_dataset.describe(include='all'))

       Gender          Age   Occupation Zip-code
count    6040  6040.000000  6040.000000     6040
unique      2          NaN          NaN     3439
top         M          NaN          NaN    48104
freq     4331          NaN          NaN       19
mean      NaN    30.639238     8.146854      NaN
std       NaN    12.895962     6.329511      NaN
min       NaN     1.000000     0.000000      NaN
25%       NaN    25.000000     3.000000      NaN
50%       NaN    25.000000     7.000000      NaN
75%       NaN    35.000000    14.000000      NaN
max       NaN    56.000000    20.000000      NaN

In [17]:
users_dataset[users_dataset['Gender'] == 'F']

       Gender  Age  Occupation Zip-code
UserID
1           F    1          10    48067
6           F   50           9    55117
10          F   35           1    95370
11          F   25           1    04093
16          F   35           0    20670
...       ...  ...         ...      ...
6035        F   25           1    78734
6036        F   25          15    32603
6037        F   45           1    76006
6038        F   56           1    14706
6039        F   45           0    01060

[1709 rows x 4 columns]

In [18]:
# cuántos usuarios son mujeres (Gender='F')
len(users_dataset[users_dataset['Gender'] == 'F'])

# select count(*) from users_dataset where users_dataset.Gender = 'F'

1709

In [20]:
set(users_dataset['Gender'])

{'F', 'M'}

In [20]:
for _genero in list(set(users_dataset['Gender'])):
    print(f"Hay {len(users_dataset[users_dataset['Gender'] == _genero])} usuarios con género {_genero}")

KeyError: 'Gender'

In [22]:
# mostrar solo los menores de edad
under_age = users_dataset[users_dataset['Age'] < 18].copy()
print(len(under_age))
display(under_age.sample(10))

222

       Gender  Age  Occupation Zip-code
UserID
580         M    1          10    08534
719         M    1           0    75070
5768        F    1           7    20852
1187        F    1           0    90210
5844        F    1          10    02131
2418        F    1          10    06074
745         M    1          10    90004
4690        F    1          10    79605
4830        M    1          10    55317
2910        M    1          19    75602

# filtrar edad incorrecta (míninimo 18)
under_age.loc['Age'] = np.nan
display(under_age.head())

users_dataset[users_dataset['Age'] < 18] = under_age
display(users_dataset.head())

In [19]:
# Agrupar datos por atributos
display(users_dataset.groupby(by='Gender').describe())

KeyError: 'Gender'

In [ ]:
# Grabar la tabla modificada
# Cambiar el separador a ','
# Guardar NaN como 'null'
ruta_output = os.path.join('res', 'ml-1m', 'o_users_processed.dat')
users_dataset.to_csv(ruta_output, sep=',',na_rep='null')

In [ ]:
%pycat res/ml-1m/o_users_processed.dat

# Ejercicios
- Hacer un análisis general de los otros dos archivos CSV en ml-1m ('movies.dat' y 'ratings.dat')
- Analizando el dataset ratings.dat, ¿hay algún usuario que no tenga ninguna review? ¿Cuántos tienen menos de 30 reviews?

In [21]:
ruta_ratings = os.path.join("res", "ml-1m", "ratings.dat")

ratings_dataset = pd.read_csv(ruta_ratings, sep='::', index_col=0, header=None, engine='python', names=['UserID', 'MovieID', 'Rating', 'Time'])
display(ratings_dataset)

        MovieID  Rating       Time
UserID
1          1193       5  978300760
1           661       3  978302109
1           914       3  978301968
1          3408       4  978300275
1          2355       5  978824291
...         ...     ...        ...
6040       1091       1  956716541
6040       1094       5  956704887
6040        562       5  956704746
6040       1096       4  956715648
6040       1097       4  956715569

[1000209 rows x 3 columns]

In [22]:
ratings_dataset.index

Int64Index([   1,    1,    1,    1,    1,    1,    1,    1,    1,    1,
            ...
            6040, 6040, 6040, 6040, 6040, 6040, 6040, 6040, 6040, 6040],
           dtype='int64', name='UserID', length=1000209)

In [23]:
len(set(list(ratings_dataset.index)))

6040

In [25]:
display(ratings_dataset[ratings_dataset.groupby('UserID').Rating.count() < 30])

C:\Users\Usuario\AppData\Local\Temp\ipykernel_24280\2035083798.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  display(ratings_dataset[ratings_dataset.groupby('UserID').Rating.count() < 30])

        MovieID  Rating       Time
UserID
4          3468       5  978294008
4          1210       3  978293924
4          2951       4  978294282
4          1214       4  978294260
4          1036       4  978294282
...         ...     ...        ...
6038       1387       2  956707005
6038       2700       1  956715051
6038       2716       3  956707604
6038       3396       3  956706827
6038       1079       5  956707547

[18169 rows x 3 columns]

In [26]:
ratings_dataset[ratings_dataset.groupby('UserID').Rating.count() < 30]

C:\Users\Usuario\AppData\Local\Temp\ipykernel_24280\2091230819.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  ratings_dataset[ratings_dataset.groupby('UserID').Rating.count() < 30]

        MovieID  Rating       Time
UserID
4          3468       5  978294008
4          1210       3  978293924
4          2951       4  978294282
4          1214       4  978294260
4          1036       4  978294282
...         ...     ...        ...
6038       1387       2  956707005
6038       2700       1  956715051
6038       2716       3  956707604
6038       3396       3  956706827
6038       1079       5  956707547

[18169 rows x 3 columns]

In [27]:
ratings_dataset.head(183)

        MovieID  Rating       Time
UserID
1          1193       5  978300760
1           661       3  978302109
1           914       3  978301968
1          3408       4  978300275
1          2355       5  978824291
...         ...     ...        ...
2          1245       2  978299200
2          1246       5  978299418
2          3893       1  978299535
2          1247       5  978298652
3          3421       4  978298147

[183 rows x 3 columns]

In [ ]:
mask = ratings_dataset.groupby(by='UserID').Rating.count() < 30

In [ ]:
len(ratings_dataset[mask].groupby(by='UserID').count())

In [ ]:
url = 'https://raw.githubusercontent.com/grammakov/USA-cities-and-states/master/us_cities_states_counties.csv'

In [ ]:
ruta = os.path.join("res", "us_cities_states_counties.csv")

In [ ]:
urllib.request.urlretrieve(url, ruta)